# select Column from DataFrame

In [1]:
import pandas as pd
dict_of_series={"one":pd.Series([1,2,3,4],index=["a","b","c","d"]),
                "two":pd.Series([5,6,7,8,9],index=["a","b","c","d","e"])}

In [2]:
dict_of_series

{'one': a    1
 b    2
 c    3
 d    4
 dtype: int64,
 'two': a    5
 b    6
 c    7
 d    8
 e    9
 dtype: int64}

In [3]:
df1=pd.DataFrame(data=dict_of_series)

In [4]:
df1

   one  two
a  1.0    5
b  2.0    6
c  3.0    7
d  4.0    8
e  NaN    9

# Selection of Column

In [5]:
#select column named "one"
df1["one"]

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
Name: one, dtype: float64

In [6]:
#select column named "one"
df1["one"].dtypes

dtype('float64')

In [7]:
df1.info() #gives error because it series

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     4 non-null      float64
 1   two     5 non-null      int64
dtypes: float64(1), int64(1)
memory usage: 280.0+ bytes

# adding column

In [8]:
df1["three"]=df1["one"]+df1["two"]

In [9]:
df1

   one  two  three
a  1.0    5    6.0
b  2.0    6    8.0
c  3.0    7   10.0
d  4.0    8   12.0
e  NaN    9    NaN

In [10]:
df1["four"]=pd.Series(data=[1,2,3,4,5])

In [11]:
df1

   one  two  three  four
a  1.0    5    6.0   NaN
b  2.0    6    8.0   NaN
c  3.0    7   10.0   NaN
d  4.0    8   12.0   NaN
e  NaN    9    NaN   NaN

In [12]:
new_col=pd.Series(data=[1,2,3,4,5])

In [13]:
new_col

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
df1["four"]=new_col

In [15]:
df1

   one  two  three  four
a  1.0    5    6.0   NaN
b  2.0    6    8.0   NaN
c  3.0    7   10.0   NaN
d  4.0    8   12.0   NaN
e  NaN    9    NaN   NaN

# deleting column

In [16]:
#using keyword del
del df1["four"]

In [17]:
df1

   one  two  three
a  1.0    5    6.0
b  2.0    6    8.0
c  3.0    7   10.0
d  4.0    8   12.0
e  NaN    9    NaN

In [18]:
#using pop() method
df1.pop("three")

a     6.0
b     8.0
c    10.0
d    12.0
e     NaN
Name: three, dtype: float64

In [19]:
df1

   one  two
a  1.0    5
b  2.0    6
c  3.0    7
d  4.0    8
e  NaN    9

# Row selection

In [20]:
#using loc[] ==> pass rowlabel

In [21]:
df1

   one  two
a  1.0    5
b  2.0    6
c  3.0    7
d  4.0    8
e  NaN    9

In [22]:
#select row b
df1.loc["b"]

one    2.0
two    6.0
Name: b, dtype: float64

In [24]:
#select row c
df1.loc["c"]

one    3.0
two    7.0
Name: c, dtype: float64

In [25]:
#select by integer location
# ==> iloc[] ==> argument as index integer of row

In [26]:
df1.iloc[-1] #pass row index

one    NaN
two    9.0
Name: e, dtype: float64

In [27]:
df1.iloc[3] #pass row index

one    4.0
two    8.0
Name: d, dtype: float64

In [28]:
# using slicing for selection rows

In [29]:
df1[1:2] #==>start (incl): end(exclu):step

   one  two
b  2.0    6

In [30]:
df1[1:4]

   one  two
b  2.0    6
c  3.0    7
d  4.0    8

In [31]:
df1[1:4]

   one  two
b  2.0    6
c  3.0    7
d  4.0    8

In [32]:
df1["one"][1:4]

b    2.0
c    3.0
d    4.0
Name: one, dtype: float64

In [33]:
df1["two"][1:4]

b    6
c    7
d    8
Name: two, dtype: int64

In [34]:
df1[['one', 'two']][0:3] #multiple Column selection

   one  two
a  1.0    5
b  2.0    6
c  3.0    7

In [35]:
lsit1=['two']

In [36]:
df1[lsit1][0:3]

   two
a    5
b    6
c    7

In [37]:
#adding row into dataframe
#append() like vstack

In [38]:
dict_of_series1={"one":pd.Series([10,11],index=["f","g"]),
                "two":pd.Series([12,13],index=["f","g"])}

In [39]:
dict_of_series1

{'one': f    10
 g    11
 dtype: int64,
 'two': f    12
 g    13
 dtype: int64}

In [40]:
df2=pd.DataFrame(data=dict_of_series1)

In [41]:
df2

   one  two
f   10   12
g   11   13

In [42]:
df1.append(df2)

    one  two
a   1.0    5
b   2.0    6
c   3.0    7
d   4.0    8
e   NaN    9
f  10.0   12
g  11.0   13

In [43]:
#delete rows  #use drop( index of row)
df1.drop("c")

   one  two
a  1.0    5
b  2.0    6
d  4.0    8
e  NaN    9

In [44]:
df1.drop("a")

   one  two
b  2.0    6
c  3.0    7
d  4.0    8
e  NaN    9

In [45]:
df1

   one  two
a  1.0    5
b  2.0    6
c  3.0    7
d  4.0    8
e  NaN    9

In [46]:
df3=pd.DataFrame([["a",1],["b",2]])

In [47]:
df3

   0  1
0  a  1
1  b  2

In [48]:
df3.drop(1)

   0  1
0  a  1

In [49]:
#if datatframe has label to row index then it is not allows as pop(index value)
df1.pop("a") #==> a as as index label

KeyError: 'a'